microchip-pic-avr-examples/pic16f18076-calculating-pulse-and-duty-cycle-mplab-melody/pic16f18076-calculating-pulse-and-duty-cycle-mplab-melody.X/Basic_Init.c
}
void CLC3_Initialize_CLCNCO2(void){
    
    // SLCT 0x2; 
    CLCSELECT = 0x2;
    // LCG1POL inverted; LCG2POL not_inverted; LCG3POL not_inverted; LCG4POL not_inverted; LCPOL not_inverted; 
    CLCnPOL = 0x1;
    // LCD1S CLCIN0 (CLCIN0PPS); 
    CLCnSEL0 = 0x0;
    // LCD2S CLC2_OUT; 
    CLCnSEL1 = 0x1D;
    // LCD3S CLCIN3 (CLCIN3PPS); 
    CLCnSEL2 = 0x3;
    // LCD4S CLCIN0 (CLCIN0PPS); 
    CLCnSEL3 = 0x0;
    // LCG1D1N disabled; LCG1D1T enabled; LCG1D2N disabled; LCG1D2T disabled; LCG1D3N disabled; LCG1D3T disabled; LCG1D4N disabled; LCG1D4T disabled; 
    CLCnGLS0 = 0x2;
    // LCG2D1N disabled; LCG2D1T disabled; LCG2D2N disabled; LCG2D2T enabled; LCG2D3N disabled; LCG2D3T disabled; LCG2D4N disabled; LCG2D4T disabled; 
    CLCnGLS1 = 0x8;
    // LCG3D1N disabled; LCG3D1T disabled; LCG3D2N disabled; LCG3D2T disabled; LCG3D3N disabled; LCG3D3T disabled; LCG3D4N disabled; LCG3D4T disabled; 
    CLCnGLS2 = 0x0;
    // LCG4D1N disabled; LCG4D1T disabled; LCG4D2N disabled; LCG4D2T disabled; LCG4D3N disabled; LCG4D3T disabled; LCG4D4N disabled; LCG4D4T disabled; 
    CLCnGLS3 = 0x0;
    // LCOUT 0x00; 
    CLCDATA = 0x0;
    // LCMODE 2-input D flip-flop with R; LCINTN disabled; LCINTP disabled; LCEN enabled; 
    CLCnCON = 0x85;

}
void CLC3_Initialize_CLCNCO3(void){
    
    // SLCT 0x2; 
    CLCSELECT = 0x2;
    // LCG1POL inverted; LCG2POL not_inverted; LCG3POL not_inverted; LCG4POL not_inverted; LCPOL not_inverted; 
    CLCnPOL = 0x1;
    // LCD1S CLCIN0 (CLCIN0PPS); 
    CLCnSEL0 = 0x0;
    // LCD2S CLC2_OUT; 
    CLCnSEL1 = 0x1D;
    // LCD3S CLCIN3 (CLCIN3PPS); 
    CLCnSEL2 = 0x3;
    // LCD4S CLCIN0 (CLCIN0PPS); 
    CLCnSEL3 = 0x0;
    // LCG1D1N disabled; LCG1D1T enabled; LCG1D2N disabled; LCG1D2T disabled; LCG1D3N disabled; LCG1D3T disabled; LCG1D4N disabled; LCG1D4T disabled; 
    CLCnGLS0 = 0x2;
    // LCG2D1N disabled; LCG2D1T disabled; LCG2D2N disabled; LCG2D2T enabled; LCG2D3N disabled; LCG2D3T disabled; LCG2D4N disabled; LCG2D4T disabled; 
    CLCnGLS1 = 0x8;
    // LCG3D1N disabled; LCG3D1T disabled; LCG3D2N disabled; LCG3D2T disabled; LCG3D3N disabled; LCG3D3T disabled; LCG3D4N disabled; LCG3D4T disabled; 
    CLCnGLS2 = 0x0;
    // LCG4D1N disabled; LCG4D1T disabled; LCG4D2N disabled; LCG4D2T disabled; LCG4D3N disabled; LCG4D3T disabled; LCG4D4N disabled; LCG4D4T disabled; 
    CLCnGLS3 = 0x0;
    // LCOUT 0x00; 
    CLCDATA = 0x0;
    // LCMODE 2-input D flip-flop with R; LCINTN disabled; LCINTP disabled; LCEN enabled; 
    CLCnCON = 0x85;

}

    //NCO1 Functions and Declarations


void NCO1_Initialize_CLCNCO1_CLCNCO2(void){
    //NPWS 1_clk; NCKS CLC1_OUT; 
    NCO1CLK = 0xA;
    //NCOACC 0x0; 
    NCO1ACCU = 0x0;
    //NCOACC 0x0; 
    NCO1ACCH = 0x0;
    //NCOACC 0x0; 
    NCO1ACCL = 0x0;
    //NCOINC 0; 
    NCO1INCU = 0x0;
    //NCOINC 0; 
    NCO1INCH = 0x0;
    //NCOINC 1; 
    NCO1INCL = 0x1;
    //NEN disabled; NPOL active_hi; NPFM FDC_mode; 
    NCO1CON = 0x0;
}
//void NCO1_Initialize(void){
//
//    //NPWS 1_clk; NCKS CLC1_OUT; 
//    NCO1CLK = 0xA;
//    //NCOACC 0x0; 
//    NCO1ACCU = 0x0;
//    //NCOACC 0x0; 
//    NCO1ACCH = 0x0;
//    //NCOACC 0x0; 
//    NCO1ACCL = 0x0;
//    //NCOINC 0; 
//    NCO1INCU = 0x0;
//    //NCOINC 0; 
//    NCO1INCH = 0x0;
//    //NCOINC 1; 
//    NCO1INCL = 0x1;
//    //NEN disabled; NPOL active_hi; NPFM FDC_mode; 
//    NCO1CON = 0x0;
//}
void NCO1_Initialize_CLCNCO3(void){
    //NPWS 1_clk; NCKS FOSC; 
    NCO1CLK = 0x0;
    //NCOACC 0x0; 
    NCO1ACCU = 0x0;
    //NCOACC 0x0; 
    NCO1ACCH = 0x0;
    //NCOACC 0x0; 
    NCO1ACCL = 0x0;
    //NCOINC 0; 
    NCO1INCU = 0x0;
    //NCOINC 130; 
    NCO1INCH = 0x82;
    //NCOINC 143; 
    NCO1INCL = 0x8F;
    //NEN enabled; NPOL active_hi; NPFM FDC_mode; 
    NCO1CON = 0x80;
}

//Initialization Functions

void Timer1_Gate_Initialize(void){
    T1GPPS = 0xD; //RB5->TMR1:T1G;
    
    Timer1_Initialize_Timer1Gate(); 
}
void CLC_NCO1_Initialize(void){
    T1CON = 0x0;
    NCO1_Initialize_CLCNCO1_CLCNCO2();
    CLC1_Initialize_CLCNCO1();
    CLC2_Initialize_CLCNCO1();
    Timer1_Initialize_CLCNCO1();
    CLC_NCO1_Pins_PPS();
    setup_for_new_measurement_CLCNCO1(); 
}
void CLC_NCO2_Initialize(void){
    T1CON = 0x0;//
    NCO1_Initialize_CLCNCO1_CLCNCO2();//
    CLC1_Initialize_CLCNCO2();
    CLC2_Initialize_CLCNCO2();
    CLC3_Initialize_CLCNCO2();
    Timer1_Initialize_CLCNCO2();
    CLC_NCO2_Pins_PPS();
    setup_for_new_measurement_CLCNCO2(); 
}
void CLC_NCO3_Initialize(void){
    T1CON = 0x0;
    NCO1_Initialize_CLCNCO3();
    CLC1_Initialize_CLCNCO3();
    CLC2_Initialize_CLCNCO3();
    CLC3_Initialize_CLCNCO3();
    Timer0_Initialize_CLCNCO3();
    Timer1_Initialize_CLCNCO3();
    CLC_NCO3_Pins_PPS();
    setup_for_new_measurement_CLCNCO3();
}
    //CCP
void IOC_w_Timer_Initialize(void){
    IOCBP = 0x20;
    IOCBN = 0x20;    
    Timer0_Initialize();
}
void IOC_wo_Timer_Initialize(void){
    IOCBP = 0x20;
    IOCBN = 0x20;
}

//Pins and PPS Functions

void CLC_NCO1_Pins_PPS(void){
    TRISA = 0xDF;//
    TRISC = 0xBB;//
    
    ANSELA = 0xD8;//
    ANSELC = 0x3A;//

    RA5PPS = 0x01;  //RA5->CLC1:CLC1OUT;
    RC2PPS = 0x02;  //RC2->CLC2:CLC2OUT;
    T1CKIPPS = 0x10; //RC0->TMR1:T1CKI;
    T1GPPS = 0xD; //RB5->TMR1:T1G;
    CLCIN0PPS = 0x2; //RA2->CLC1:CLCIN0;
    CLCIN1PPS = 0x1; //RA1->CLC2:CLCIN1;
}
void CLC_NCO2_Pins_PPS(void){
    TRISA = 0xDF;
    TRISB = 0xFD;
    TRISC = 0xBB;
    
    ANSELA = 0xDA;
    ANSELB = 0xD1;
    ANSELC = 0x3B;
    
    RA5PPS = 0x01;  //RA5->CLC1:CLC1OUT;
    RC2PPS = 0x02;  //RC2->CLC2:CLC2OUT;
    T1CKIPPS = 0x10; //RC0->TMR1:T1CKI;
    T1GPPS = 0xD; //RB5->TMR1:T1G;
    CLCIN0PPS = 0x2; //RA2->CLC1:CLCIN0;
    CLCIN1PPS = 0x1; //RA1->CLC2:CLCIN1;
}
void CLC_NCO3_Pins_PPS(void){
    TRISA = 0xDF;
    TRISB = 0xFD;
    TRISC = 0xBB;
    
    ANSELA = 0xDA;
    ANSELB = 0xDD;
    ANSELC = 0x3B;
    
    RA5PPS = 0x01;  //RA5->CLC1:CLC1OUT;
    RC2PPS = 0x02;  //RC2->CLC2:CLC2OUT;
    RB1PPS = 0x03;  //RB1->CLC3:CLC3OUT;
    CLCIN0PPS = 0x2; //RA2->CLC1:CLCIN0;
}

//Reset-Clear Functions

void TMR0_Reset(void){
    TMR0H = 0xFF;
    TMR0L = 0x0;
    T0CON1 = 0x0;
    T0CON0 = 0x0;
}
void TMR1_Reset(void){
    T1GCON = 0x0;
    T1GATE = 0x0;
    T1CLK = 0x0;
    TMR1H = 0x0;
    TMR1L = 0x0;
}
void CLC1_Reset(void){
    CLCSELECT = 0x0;
    CLCnPOL = 0x0;
    CLCnSEL0 = 0x0;
    CLCnSEL1 = 0x0;
    CLCnSEL2 = 0x0;
    CLCnSEL3 = 0x0;
    CLCnGLS0 = 0x0;
    CLCnGLS1 = 0x0;
    CLCnGLS2 = 0x0;
    CLCnGLS3 = 0x0;
    CLCDATA = 0x0;
    CLCnCON = 0x0;
}
void CLC2_Reset(void){
    CLCSELECT = 0x1;
    CLCnPOL = 0x0;
    CLCnSEL0 = 0x0;
    CLCnSEL1 = 0x0;
    CLCnSEL2 = 0x0;
    CLCnSEL3 = 0x0;
    CLCnGLS0 = 0x0;
    CLCnGLS1 = 0x0;
    CLCnGLS2 = 0x0;
    CLCnGLS3 = 0x0;
    CLCDATA = 0x0;
    CLCnCON = 0x0;
}
void CLC3_Reset(void){
    CLCSELECT = 0x2;
    CLCnPOL = 0x0;
    CLCnSEL0 = 0x0;
    CLCnSEL1 = 0x0;
    CLCnSEL2 = 0x0;
    CLCnSEL3 = 0x0;
    CLCnGLS0 = 0x0;
    CLCnGLS1 = 0x0;
    CLCnGLS2 = 0x0;
    CLCnGLS3 = 0x0;
    CLCDATA = 0x0;
    CLCnCON = 0x0;
}
void IOC_Reset(void){
    IOCBP = 0x00;
    IOCBN = 0x00;
}
void Pins_PPS_Reset(void){
    PIN_MANAGER_Initialize();
    RA5PPS = 0x0;  //Reset RA5
    RB1PPS = 0x0;  //Reset RB1
    RC2PPS = 0x0;  //Reset RC2
    T1CKIPPS = 0x10; //Reset T1CK
    T1GPPS = 0xD; //Reset T1G
    CLCIN0PPS = 0x0; //Reset CLCIN0
    CLCIN1PPS = 0x1; //Reset CLCIN1
}